Revit 2024 API
Schema.GUID Property
 The identifier of the Schema. Setter made unavailable, because it would violate set-correctness
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Guid GUID { get; }
Visual Basic
Public ReadOnly Property GUID As Guid
	Get
Visual C++
public:
property Guid GUID {
	Guid get ();
}
See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace